; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
; params: satgen 19584 1 1 2 8 5
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	infrared1 - mode
	image0 - mode
	Star0 - direction
	Star2 - direction
	GroundStation3 - direction
	Star4 - direction
	GroundStation5 - direction
	Star6 - direction
	GroundStation7 - direction
	Star1 - direction
	Star8 - direction
	Star9 - direction
	Phenomenon10 - direction
	Star11 - direction
	Planet12 - direction
)
(:init
	(supports instrument0 image0)
	(supports instrument0 infrared1)
	(calibration_target instrument0 Star1)
	(on_board instrument0 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star8)
)
(:goal (and
	(have_image Star8 image0)
	(have_image Star9 infrared1)
	(have_image Phenomenon10 image0)
	(have_image Star11 infrared1)
	(have_image Planet12 infrared1)
))

)

; plan
1. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 0 of 5
2. (turn_to satellite0 star1 star8)
   deleted: (pointing satellite0 star8)
   added: (pointing satellite0 star1)
   goals met: 0 of 5
3. (calibrate satellite0 instrument0 star1)
   added: (calibrated instrument0)
   goals met: 0 of 5
4. (turn_to satellite0 star9 star1)
   deleted: (pointing satellite0 star1)
   added: (pointing satellite0 star9)
   goals met: 0 of 5
5. (take_image satellite0 star9 instrument0 infrared1)
   added: (have_image star9 infrared1)
   goals met: 1 of 5
6. (turn_to satellite0 star11 star9)
   deleted: (pointing satellite0 star9)
   added: (pointing satellite0 star11)
   goals met: 1 of 5
7. (take_image satellite0 star11 instrument0 infrared1)
   added: (have_image star11 infrared1)
   goals met: 2 of 5
8. (turn_to satellite0 planet12 star11)
   deleted: (pointing satellite0 star11)
   added: (pointing satellite0 planet12)
   goals met: 2 of 5
9. (take_image satellite0 planet12 instrument0 infrared1)
   added: (have_image planet12 infrared1)
   goals met: 3 of 5
10. (turn_to satellite0 phenomenon10 planet12)
   deleted: (pointing satellite0 planet12)
   added: (pointing satellite0 phenomenon10)
   goals met: 3 of 5
11. (take_image satellite0 phenomenon10 instrument0 image0)
   added: (have_image phenomenon10 image0)
   goals met: 4 of 5
12. (turn_to satellite0 star8 phenomenon10)
   deleted: (pointing satellite0 phenomenon10)
   added: (pointing satellite0 star8)
   goals met: 4 of 5
13. (take_image satellite0 star8 instrument0 image0)
   added: (have_image star8 image0)
   goals met: 5 of 5
